function get_hl(date) {
	var HuangLi_y2018 = {
		"0101": {
			"y": "祭祀.塑绘.开光.裁衣.冠笄.嫁娶.纳采.拆卸.修造.动土.竖柱.上梁.安床.移徙.入宅.安香.结网.捕捉.畋猎.伐木.进人口.放水.",
			"j": "出行.安葬.修坟.开市.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"0201": {
			"y": "祭祀.沐浴.祈福.斋醮.订盟.纳采.裁衣.拆卸.起基.竖柱.上梁.安床.入殓.除服.成服.移柩.启攒.挂匾.求嗣.出行.合帐.造畜椆栖.",
			"j": "开仓.嫁娶.移徙.入宅.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲戊午",
			"ts": "占门碓外东南"
		},
		"0102": {
			"y": "祭祀.求医.破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"0103": {
			"y": "祭祀.祈福.斋醮.出行.冠笄.安机械.移徙.入宅.安香.安床.除服.成服.移柩.启攒.",
			"j": "开光.栽种.治病.安门.作灶.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"0104": {
			"y": "塑绘.斋醮.出行.拆卸.解除.修造.移徙.造船.入殓.除服.成服.移柩.启攒.修坟.立碑.谢土.",
			"j": "",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"0105": {
			"y": "祭祀.斋醮.入殓.破土.启攒.安葬.修坟.立碑.除服.成服.",
			"j": "嫁娶.入宅.作灶.纳采.订盟.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		},
		"0106": {
			"y": "祭祀.斋醮.纳财.捕捉.畋猎.",
			"j": "嫁娶.开市.入宅.安床.破土.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲壬辰",
			"ts": "房床栖房内南"
		},
		"0107": {
			"y": "纳采.订盟.祭祀.祈福.求嗣.斋醮.沐浴.进人口.会亲友.入学.治病.安碓硙.掘井.开池.纳畜.牧养.造畜椆栖.",
			"j": "嫁娶.合帐.入宅.行丧.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲癸巳",
			"ts": "占门床房内南"
		},
		"0108": {
			"y": "祭祀.祈福.求嗣.沐浴.问名.交易.纳财.入殓.移柩.安葬.修坟.立碑.谢土.造畜椆栖.教牛马.",
			"j": "入宅.置产.嫁娶.动土.栽种.开市.开光.动土.破土.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲甲午",
			"ts": "占碓磨房内南"
		},
		"0109": {
			"y": "祭祀.教牛马.造畜椆栖.祭祀.会亲友.解除.余事勿取.",
			"j": "嫁娶.入宅.出行.动土.破土.安葬.行丧.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲乙未",
			"ts": "厨灶厕房内南"
		},
		"0110": {
			"y": "嫁娶.开光.解除.出火.拆卸.修造.进人口.入宅.移徙.安床.栽种.入殓.修坟.动土.除服.成服.",
			"j": "作灶.安葬.祭祀.开市.纳采.订盟.纳畜.谢土.出行.探病.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲丙申",
			"ts": "仓库炉房内南"
		},
		"0111": {
			"y": "出行.起基.安床.纳财.交易.立券.嫁娶.栽种.入殓.移柩.安葬.",
			"j": "挂匾.入宅.上梁.祈福.词讼.作梁.作灶.开池.安门.动土.破土.掘井.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "满",
			"zc": "正冲正冲丁酉",
			"ts": "房床门房内南"
		},
		"0112": {
			"y": "平治道涂.余事勿取.",
			"j": "开光.嫁娶.开仓.出货财.造船.安葬.探病.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "平",
			"zc": "正冲正冲戊戌",
			"ts": "门鸡栖房内东"
		},
		"0113": {
			"y": "嫁娶.订盟.纳采.会亲友.祭祀.安机械.移徙.入宅.造屋.安床.起基.定磉.安香.出火.挂匾.拆卸.置产.",
			"j": "开市.出行.安葬.行丧.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲己亥",
			"ts": "碓磨床房内东"
		},
		"0114": {
			"y": "沐浴.捕捉.畋猎.理发.整手足甲.入殓.除服.成服.破土.安葬.谢土.立碑.修坟.启攒.",
			"j": "纳采.订盟.嫁娶.上梁.开市.斋醮.造屋.安门.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲庚子",
			"ts": "厨灶碓房内东"
		},
		"0115": {
			"y": "祭祀.破屋.坏垣.余事勿取.",
			"j": "斋醮.嫁娶.开市.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲辛丑",
			"ts": "仓库厕房内东"
		},
		"0116": {
			"y": "沐浴.开仓.出货财.开市.交易.立券.纳财.栽种.纳畜.牧养.畋猎.入殓.破土.安葬.",
			"j": "祈福.嫁娶.安床.入宅.造船.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲壬寅",
			"ts": "房床炉房内东"
		},
		"0117": {
			"y": "祭祀.沐浴.补垣.塞穴.断蚁.解除.余事勿取.",
			"j": "造庙.入宅.修造.安葬.行丧.嫁娶.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲癸卯",
			"ts": "占大门外东北"
		},
		"0118": {
			"y": "嫁娶.纳采.订盟.问名.祭祀.冠笄.裁衣.会亲友.进人口.纳财.捕捉.作灶.",
			"j": "开市.安床.安葬.修坟.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲甲辰",
			"ts": "碓磨栖外东北"
		},
		"0119": {
			"y": "订盟.纳采.会亲友.祭祀.斋醮.沐浴.塑绘.出火.开光.竖柱.上梁.开市.交易.立券.作梁.开柱眼.伐木.架马.安门.安床.拆卸.牧养.造畜椆栖.掘井.",
			"j": "造庙.嫁娶.出行.动土.安葬.行丧.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲乙巳",
			"ts": "厨灶床外东北"
		},
		"0120": {
			"y": "交易.立券.纳财.安床.裁衣.造畜椆栖.安葬.谢土.启攒.除服.成服.修坟.立碑.移柩.入殓.",
			"j": "开光.嫁娶.开市.动土.破土.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲丙午",
			"ts": "仓库碓外东北"
		},
		"0121": {
			"y": "祭祀.解除.教牛马.会亲友.余事勿取.",
			"j": "破土.动土.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲丁未",
			"ts": "房床厕外东北"
		},
		"0122": {
			"y": "纳采.订盟.移徙.纳财.开市.交易.立券.入宅.会亲友.解除.求医.治病.入学.安床.安门.安香.出火.拆卸.扫舍.入宅.挂匾.开生坟.合寿木.破土.修坟.启攒.入殓.",
			"j": "探病.祭祀.出行.上梁.造屋.谢土.安葬.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲戊申",
			"ts": "占门炉外东北"
		},
		"0123": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.求嗣.会亲友.解除.出行.入学.纳财.开市.交易.立券.习艺.经络.安床.开仓.出货财.纳畜.安葬.启攒.修坟.入殓.",
			"j": "入宅.开光.开市.动土.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "满",
			"zc": "正冲正冲己酉",
			"ts": "碓磨门外正东"
		},
		"0124": {
			"y": "祭祀.冠笄.嫁娶.会亲友.进人口.裁衣.结网.平治道涂.",
			"j": "移徙.入宅.造庙.作灶.治病.安葬.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "平",
			"zc": "正冲正冲庚戌",
			"ts": "厨灶栖外正东"
		},
		"0125": {
			"y": "祭祀.安碓硙.结网.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲辛亥",
			"ts": "仓库床外正东"
		},
		"0126": {
			"y": "嫁娶.祭祀.沐浴.裁衣.出行.理发.移徙.捕捉.畋猎.放水.入宅.除服.成服.启攒.安葬.移柩.入殓.",
			"j": "造屋.开市.动土.破土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲壬子",
			"ts": "房床碓外正东"
		},
		"0127": {
			"y": "破屋.坏垣.余事勿取.",
			"j": "嫁娶.开市.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲癸丑",
			"ts": "占门厕外正东"
		},
		"0128": {
			"y": "纳采.订盟.祭祀.求嗣.出火.塑绘.裁衣.会亲友.入学.拆卸.扫舍.造仓.挂匾.掘井.开池.结网.栽种.纳畜.破土.修坟.立碑.安葬.入殓.",
			"j": "祈福.嫁娶.造庙.安床.谢土.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲甲寅",
			"ts": "碓磨炉外东南"
		},
		"0129": {
			"y": "入殓.除服.成服.移柩.启攒.安葬.修坟.立碑.",
			"j": "开市.伐木.嫁娶.作梁.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲乙卯",
			"ts": "厨灶门外东南"
		},
		"0130": {
			"y": "祭祀.作灶.入殓.除服.余事勿取.",
			"j": "开市.安床.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲丙辰",
			"ts": "仓库栖外东南"
		},
		"0131": {
			"y": "塑绘.开光.沐浴.冠笄.会亲友.作灶.放水.造畜椆栖.",
			"j": "嫁娶.入殓.安葬.出行.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲丁巳",
			"ts": "占房床外东南"
		},
		"0227": {
			"y": "裁衣.合帐.入殓.除服.成服.会亲友.纳财.",
			"j": "祭祀.祈福.移徙.嫁娶.入宅.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲甲申",
			"ts": "碓磨炉外正北"
		},
		"0212": {
			"y": "纳采.祭祀.祈福.出行.会亲友.修造.动土.移徙.入宅.",
			"j": "嫁娶.开市.安葬.破土.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "收",
			"zc": "正冲正冲己巳",
			"ts": "碓磨床外西南"
		},
		"0202": {
			"y": "祭祀.解除.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲己未",
			"ts": "碓磨厕外东南"
		},
		"0222": {
			"y": "祭祀.冠笄.嫁娶.拆卸.修造.动土.起基.上梁.造屋.入宅.开市.开池.塞穴.入殓.除服.成服.移柩.安葬.破土.",
			"j": "安床.栽种.治病.作灶.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "危",
			"zc": "正冲正冲己卯",
			"ts": "占门炉外西北"
		},
		"0217": {
			"y": "会亲友.求嗣.理发.冠笄.结网.捕捉.开光.理发.",
			"j": "开市.动土.安葬.破土.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲甲戌",
			"ts": "碓磨栖外正西"
		},
		"0225": {
			"y": "祭祀.沐浴.开光.塑绘.祈福.求嗣.订盟.纳采.冠笄.裁衣.嫁娶.动土.除服.成服.移柩.破土.启攒.出行.安碓硙.放水.开市.立券.交易.",
			"j": "安葬.上梁.入宅.作灶.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "开",
			"zc": "正冲正冲壬午",
			"ts": "房床碓外正北"
		},
		"0215": {
			"y": "纳采.会亲友.竖柱.上梁.立券.入殓.移柩.安葬.启攒.",
			"j": "祭祀.移徙.入宅.动土.破土.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲壬申",
			"ts": "房床厕外正南"
		},
		"0207": {
			"y": "嫁娶.祭祀.冠笄.修饰垣墙.置产.",
			"j": "经络.探病.造屋.作灶.动土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲甲子",
			"ts": "占碓磨外正南"
		},
		"0224": {
			"y": "塑绘.开光.祈福.求嗣.订盟.纳采.裁衣.冠笄.拆卸.修造.动土.起基.安门.安床.移徙.造仓.结网.纳畜.",
			"j": "伐木.作灶.安葬.取渔.入宅.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "收",
			"zc": "正冲正冲辛巳",
			"ts": "仓库床外西北"
		},
		"0315": {
			"y": "嫁娶.冠笄.会亲友.安机械.纳财.交易.立券.置产.",
			"j": "开市.造屋.治病.作灶.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "平",
			"zc": "正冲正冲庚子",
			"ts": "厨灶碓房内东"
		},
		"0203": {
			"y": "沐浴.解除.订盟.纳采.裁衣.冠笄.拆卸.修造.动土.移徙.入宅.除服.成服.移柩.破土.启攒.安葬.扫舍.修坟.伐木.纳财.交易.立券.",
			"j": "作灶.祭祀.上梁.出行.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲庚申",
			"ts": "厨灶炉外正南"
		},
		"0204": {
			"y": "祭祀.祈福.求嗣.开光.嫁娶.出行.解除.伐木.拆卸.进人口.安床.动土.起基.上梁.栽种.纳畜.破土.谢土.启攒.安葬.",
			"j": "移徙.入宅.出火.作灶.掘井.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲辛酉",
			"ts": "仓库门外正南"
		},
		"0205": {
			"y": "会亲友.冠笄.安床.会亲友.安机械.祭祀.祈福.求嗣.经络.",
			"j": "嫁娶.开市.动土.作灶.安葬.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲壬戌",
			"ts": "房床栖外正南"
		},
		"0206": {
			"y": "作灶.解除.平治道涂.余事勿取.",
			"j": "祭祀.祈福.安葬.安门.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲癸亥",
			"ts": "占门床外正南"
		},
		"0208": {
			"y": "纳采.嫁娶.祭祀.祈福.出行.修造.动土.移徙.入宅.安葬.破土.",
			"j": "开市.入宅.斋醮.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲乙丑",
			"ts": "厨灶厕外西南"
		},
		"0209": {
			"y": "祭祀.沐浴.解除.理发.扫舍.破屋.坏垣.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "破",
			"zc": "正冲正冲丙寅",
			"ts": "仓库炉外西南"
		},
		"0210": {
			"y": "纳采.订盟.祭祀.祈福.安香.出火.修造.出行.开市.移徙.入宅.动土.安葬.破土.",
			"j": "安床.作灶.造船.会亲友.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "危",
			"zc": "正冲正冲丁卯",
			"ts": "房床门外西南"
		},
		"0211": {
			"y": "塞穴.结网.取渔.畋猎.",
			"j": "嫁娶.安门.移徙.入宅.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "成",
			"zc": "正冲正冲戊辰",
			"ts": "门鸡栖外西南"
		},
		"0213": {
			"y": "纳采.嫁娶.祭祀.祈福.出行.开市.会亲友.动土.破土.启攒.",
			"j": "移徙.入宅.出火.安门.安葬.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "开",
			"zc": "正冲正冲庚午",
			"ts": "厨灶碓外西南"
		},
		"0214": {
			"y": "祭祀.祈福.求嗣.斋醮.入殓.除服.成服.移柩.安葬.启攒.",
			"j": "嫁娶.动土.开光.造屋.破土.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲辛未",
			"ts": "仓库厕外西南"
		},
		"0216": {
			"y": "祭祀.祈福.斋醮.出行.开市.立券.动土.移徙.入宅.破土.安葬.",
			"j": "开光.嫁娶.作灶.掘井.纳畜.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲癸酉",
			"ts": "占门厕外正南"
		},
		"0218": {
			"y": "祭祀.平治道涂.余事勿取.",
			"j": "嫁娶.祈福.掘井.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲乙亥",
			"ts": "厨灶床外正西"
		},
		"0219": {
			"y": "祈福.求嗣.斋醮.纳采.嫁娶.伐木.修造.动土.移徙.入宅.造庙.安机械.开市.入殓.除服.成服.移柩.安葬.破土.谢土.",
			"j": "置产.造屋.合脊.开光.探病.安门.作灶.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲丙子",
			"ts": "仓库碓外西北"
		},
		"0220": {
			"y": "入学.习艺.出行.纳采.订盟.嫁娶.会亲友.进人口.牧养.捕捉.入殓.移柩.安葬.启攒.",
			"j": "开光.开市.入宅.动土.造屋.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲丁丑",
			"ts": "房床厕外西北"
		},
		"0221": {
			"y": "祭祀.沐浴.求医.治病.扫舍.破屋.坏垣.解除.余事勿取.",
			"j": "入宅.开市.安葬.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "破",
			"zc": "正冲正冲戊寅",
			"ts": "占门炉外西北"
		},
		"0223": {
			"y": "祭祀.结网.入殓.除服.成服.移柩.安葬.破土.",
			"j": "余事勿取.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "成",
			"zc": "正冲正冲庚辰",
			"ts": "厨灶栖外西北"
		},
		"0226": {
			"y": "祭祀.祈福.求嗣.酬神.裁衣.安床.立券.交易.入殓.除服.成服.移柩.谢土.启攒.",
			"j": "出行.嫁娶.入宅.动土.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲癸未",
			"ts": "占门厕外正北"
		},
		"0228": {
			"y": "祭祀.斋醮.裁衣.合帐.冠笄.订盟.纳采.嫁娶.入宅.安香.谢土.入殓.移柩.破土.立碑.安香.会亲友.出行.祈福.求嗣.立碑.上梁.放水.",
			"j": "掘井.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲乙酉",
			"ts": "厨灶门外正北"
		},
		"0325": {
			"y": "扫舍.塞穴.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "除",
			"zc": "正冲正冲庚戌",
			"ts": "厨灶栖外正东"
		},
		"0415": {
			"y": "祭祀.捕捉.解除.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲辛未",
			"ts": "仓库厕外西南"
		},
		"0301": {
			"y": "安床.合帐.入宅.问名.纳采.求嗣.祭祀.开仓.",
			"j": "斋醮.作灶.安床.安葬.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲丙戌",
			"ts": "仓库栖外正北"
		},
		"0302": {
			"y": "作灶.平治道涂.",
			"j": "祭祀.祈福.安葬.安门.余事勿取.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"0303": {
			"y": "塑绘.开光.酬神.斋醮.订盟.纳采.裁衣.合帐.拆卸.动土.上梁.安床.安香.造庙.挂匾.会亲友.进人口.出行.修造.纳财.伐木.放水.出火.纳畜.沐浴.安门.",
			"j": "造屋.栽种.安葬.作灶.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"0304": {
			"y": "祭祀.祈福.酬神.订盟.纳采.冠笄.裁衣.合帐.嫁娶.安床.移徙.入宅.安香.入殓.移柩.启攒.安葬.解除.取渔.捕捉.伐木.安门.出火.",
			"j": "栽种.动土.开市.作灶.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"0305": {
			"y": "嫁娶.开光.祭祀.祈福.求嗣.出行.出火.入宅.移徙.解除.栽种.伐木.破土.谢土.安葬.",
			"j": "开市.交易.作灶.纳财.上梁.安床.造屋.造船.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"0306": {
			"y": "破屋.坏垣.求医.治病.余事勿取.",
			"j": "开光.嫁娶.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		},
		"0307": {
			"y": "纳采.交易.立券.安床.安机械.安葬.移柩.动土.破土.立碑.",
			"j": "嫁娶.开光.作灶.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲壬辰",
			"ts": "房床栖房内南"
		},
		"0308": {
			"y": "祭祀.祈福.求嗣.斋醮.沐浴.开光.理发.经络.解除.治病.治病.立碑.栽种.牧养.掘井.开池.",
			"j": "嫁娶.定磉.合寿木.安葬.行丧.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲癸巳",
			"ts": "占门床房内南"
		},
		"0309": {
			"y": "纳财.交易.立券.栽种.捕捉.结网.取渔.进人口.教牛马.理发.",
			"j": "入宅.造屋.竖柱.安葬.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲甲午",
			"ts": "占碓磨房内南"
		},
		"0310": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.出行.修造.动土.移徙.入宅.破土.出火.安门.安床.上梁.立碑.移柩.",
			"j": "开市.交易.合帐.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲乙未",
			"ts": "厨灶厕房内南"
		},
		"0311": {
			"y": "冠笄.立券.交易.修造.动土.安机械.入殓.安葬.破土.",
			"j": "嫁娶.祈福.出火.入宅.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲丙申",
			"ts": "仓库炉房内南"
		},
		"0312": {
			"y": "祭祀.会亲友.出行.立券.交易.冠笄.纳财.",
			"j": "嫁娶.动土.掘井.起基.定磉.破土.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "建",
			"zc": "正冲正冲丁酉",
			"ts": "房床门房内南"
		},
		"0313": {
			"y": "祭祀.沐浴.解除.扫舍.塞穴.牧养.",
			"j": "嫁娶.安葬.行丧.安门.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "除",
			"zc": "正冲正冲戊戌",
			"ts": "门鸡栖房内东"
		},
		"0314": {
			"y": "纳财.开市.交易.立券.开光.针灸.会亲友.理发.安床.造仓.结网.",
			"j": "移徙.入宅.栽种.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "满",
			"zc": "正冲正冲己亥",
			"ts": "碓磨床房内东"
		},
		"0316": {
			"y": "嫁娶.造车器.纳采.订盟.祭祀.祈福.安机械.移徙.入宅.开市.立券.破土.安葬.",
			"j": "纳畜.理发.合寿木.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲辛丑",
			"ts": "仓库厕房内东"
		},
		"0317": {
			"y": "祈福.斋醮.出行.移徙.入宅.修造.动土.破土.安葬.",
			"j": "纳采.开光.安床.嫁娶.开市.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲壬寅",
			"ts": "房床炉房内东"
		},
		"0318": {
			"y": "破屋.坏垣.余事勿取.",
			"j": "嫁娶.移徙.开市.入宅.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲癸卯",
			"ts": "占大门外东北"
		},
		"0319": {
			"y": "嫁娶.冠笄.祭祀.出行.会亲友.修造.动土.入殓.破土.",
			"j": "塑绘.开光.造桥.除服.成服.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲甲辰",
			"ts": "碓磨栖外东北"
		},
		"0320": {
			"y": "开光.求嗣.出行.纳采.冠笄.出火.拆卸.起基.修造.动土.上梁.移徙.造船.开市.交易.立券.纳财.",
			"j": "祈福.嫁娶.安葬.破土.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲乙巳",
			"ts": "厨灶床外东北"
		},
		"0321": {
			"y": "理发.冠笄.嫁娶.进人口.栽种.捕捉.针灸.",
			"j": "纳财.开市.安葬.破土.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲丙午",
			"ts": "仓库碓外东北"
		},
		"0322": {
			"y": "开光.祈福.求嗣.出行.解除.伐木.造屋.起基.修造.架马.安门.移徙.入宅.造庙.除服.成服.移柩.谢土.纳畜.牧养.",
			"j": "纳采.动土.开市.交易.安门.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲丁未",
			"ts": "房床厕外东北"
		},
		"0323": {
			"y": "裁衣.经络.伐木.开柱眼.拆卸.修造.动土.上梁.合脊.合寿木.入殓.除服.成服.移柩.破土.安葬.启攒.修坟.立碑.",
			"j": "祭祀.嫁娶.出行.上梁.掘井.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲戊申",
			"ts": "占门炉外东北"
		},
		"0324": {
			"y": "祭祀.会亲友.立券.交易.裁衣.合帐.嫁娶.冠笄.进人口.",
			"j": "栽种.动土.安葬.掘井.修坟.探病.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "建",
			"zc": "正冲正冲己酉",
			"ts": "碓磨门外正东"
		},
		"0326": {
			"y": "塑绘.开光.订盟.纳采.裁衣.合帐.冠笄.安机械.会亲友.纳财.开市.立券.交易.安床.竖柱.上梁.结网.栽种.解除.经络.",
			"j": "作灶.出行.入宅.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "满",
			"zc": "正冲正冲辛亥",
			"ts": "仓库床外正东"
		},
		"0327": {
			"y": "祭祀.嫁娶.纳婿.除服.成服.入殓.移柩.",
			"j": "动土.作灶.入宅.开光.安床.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "平",
			"zc": "正冲正冲壬子",
			"ts": "房床碓外正东"
		},
		"0328": {
			"y": "祈福.求嗣.开光.塑绘.斋醮.订盟.纳采.嫁娶.拆卸.安床.入宅.安香.移柩.修坟.安葬.谢土.栽种.解除.冠笄.裁衣.移徙.修造.动土.竖柱.放水.启攒.立碑.",
			"j": "赴任.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲癸丑",
			"ts": "占门厕外正东"
		},
		"0329": {
			"y": "祭祀.解除.入殓.除服.成服.移柩.启攒.安葬.修坟.立碑.谢土.沐浴.扫舍.捕捉.取渔.结网.畋猎.理发.",
			"j": "安床.嫁娶.作灶.入宅.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲甲寅",
			"ts": "碓磨炉外东南"
		},
		"0330": {
			"y": "破屋.坏垣.",
			"j": "诸事不宜.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲乙卯",
			"ts": "厨灶门外东南"
		},
		"0331": {
			"y": "祭祀.出行.订盟.纳采.裁衣.合帐.冠笄.进人口.动土.安床.作灶.入殓.移柩.安葬.破土.结网.取渔.畋猎.",
			"j": "作梁.造庙.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲丙辰",
			"ts": "仓库栖外东南"
		},
		"0425": {
			"y": "诸事不宜.",
			"j": "诸事不宜.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲辛巳",
			"ts": "仓库床外西北"
		},
		"0426": {
			"y": "祭祀.塑绘.开光.订盟.纳采.冠笄.裁衣.安机械.拆卸.修造.动土.安床.经络.开市.",
			"j": "出火.入宅.安葬.伐木.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲壬午",
			"ts": "房床碓外正北"
		},
		"0416": {
			"y": "纳采.嫁娶.出行.开市.立券.纳畜.牧养.出火.移徙.入宅.",
			"j": "祈福.动土.破土.安葬.入殓.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "开",
			"zc": "正冲正冲壬申",
			"ts": "房床厕外正南"
		},
		"0406": {
			"y": "祭祀.修饰垣墙.余事勿取.",
			"j": "开光.修造.动土.破土.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲壬戌",
			"ts": "房床栖外正南"
		},
		"0423": {
			"y": "祭祀.祈福.开光.求嗣.斋醮.纳采.订盟.求医.治病.起基.定磉.造船.取渔.解除.安葬.启攒.谢土.入殓.",
			"j": "开市.动土.掘井.开池.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲己卯",
			"ts": "占门炉外西北"
		},
		"0427": {
			"y": "祭祀.余事勿取.",
			"j": "造庙.嫁娶.安床.余事勿取.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲癸未",
			"ts": "占门厕外正北"
		},
		"0526": {
			"y": "开光.出行.纳采.嫁娶.伐木.架马.出火.拆卸.移徙.入宅.造庙.造桥.造船.造畜椆栖.开市.入殓.除服.成服.移柩.安葬.",
			"j": "",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲壬子",
			"ts": "房床碓外正东"
		},
		"0401": {
			"y": "祭祀.开光.塑绘.订盟.纳采.合帐.冠笄.拆卸.动土.起基.上梁.入宅.安香.开市.立券.纳财.沐浴.求嗣.出火.竖柱.安门.",
			"j": "造庙.嫁娶.伐木.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲丁巳",
			"ts": "占房床外东南"
		},
		"0402": {
			"y": "祭祀.沐浴.捕捉.栽种.",
			"j": "嫁娶.入宅.移徙.作灶.安葬.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲戊午",
			"ts": "占门碓外东南"
		},
		"0403": {
			"y": "祭祀.开光.塑绘.酬神.斋醮.订盟.纳采.嫁娶.裁衣.动土.起基.出火.拆卸.移徙.入宅.安香.修造.竖柱.上梁.纳畜.牧养.祈福.求嗣.解除.伐木.定磉.造屋.安门.",
			"j": "栽种.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲己未",
			"ts": "碓磨厕外东南"
		},
		"0404": {
			"y": "订盟.纳采.冠笄.拆卸.修造.动土.安床.入殓.除服.成服.移柩.安葬.破土.启攒.造仓.",
			"j": "作灶.开光.嫁娶.开市.入宅.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲庚申",
			"ts": "厨灶炉外正南"
		},
		"0405": {
			"y": "祭祀.出行.修造.动土.合帐.造畜椆栖.安床.移徙.入殓.移柩.破土.启攒.安葬.开生坟.合寿木.补垣.塞穴.",
			"j": "移徙.入宅.作灶.理发.开光.安门.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲辛酉",
			"ts": "仓库门外正南"
		},
		"0407": {
			"y": "嫁娶.祭祀.祈福.求嗣.斋醮.开光.出火.移徙.入宅.竖柱.上梁.会亲友.造屋.起基.治病.治病.安门.造车器.掘井.开池.",
			"j": "纳采.出行.修坟.安葬.开市.立券.作灶.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲癸亥",
			"ts": "占门床外正南"
		},
		"0408": {
			"y": "祭祀.塑绘.开光.纳采.嫁娶.开市.出行.会亲友.安床.结网.除服.成服.启攒.安葬.移柩.",
			"j": "祈福.入宅.造屋.动土.破土.探病.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲甲子",
			"ts": "占碓磨外正南"
		},
		"0409": {
			"y": "祭祀.作灶.平治道涂.余事勿取.",
			"j": "安床.入宅.安碓硙.栽种.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲乙丑",
			"ts": "厨灶厕外西南"
		},
		"0410": {
			"y": "祭祀.祈福.求嗣.斋醮.沐浴.纳畜.入殓.破土.安葬.",
			"j": "移徙.入宅.嫁娶.出行.安床.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲丙寅",
			"ts": "仓库炉外西南"
		},
		"0411": {
			"y": "纳采.祭祀.祈福.求嗣.斋醮.出行.起基.造屋.定磉.安门.入殓.安葬.",
			"j": "嫁娶.开市.纳财.出火.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲丁卯",
			"ts": "房床门外西南"
		},
		"0412": {
			"y": "祭祀.沐浴.解除.求医.治病.破屋.坏垣.余事勿取.",
			"j": "祈福.斋醮.开市.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲戊辰",
			"ts": "门鸡栖外西南"
		},
		"0413": {
			"y": "沐浴.捕捉.畋猎.结网.取渔.",
			"j": "祭祀.嫁娶.入宅.作灶.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲己巳",
			"ts": "碓磨床外西南"
		},
		"0414": {
			"y": "祭祀.祈福.求嗣.斋醮.纳采.订盟.开光.竖柱.上梁.开仓.出货财.造屋.起基.定磉.安门.诸事不宜.破土.入殓.启攒.谢土.",
			"j": "出火.嫁娶.开市.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲庚午",
			"ts": "厨灶碓外西南"
		},
		"0417": {
			"y": "祭祀.祈福.求嗣.斋醮.冠笄.作灶.纳财.交易.",
			"j": "开光.嫁娶.掘井.安葬.安门.探病.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲癸酉",
			"ts": "占门厕外正南"
		},
		"0418": {
			"y": "祭祀.解除.教牛马.出行.余事勿取.",
			"j": "动土.破土.行丧.开光.作梁.安葬.探病.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲甲戌",
			"ts": "碓磨栖外正西"
		},
		"0419": {
			"y": "沐浴.斋醮.解除.求医.治病.会亲友.造畜椆栖.栽种.理发.扫舍.",
			"j": "开市.嫁娶.移徙.入宅.掘井.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲乙亥",
			"ts": "厨灶床外正西"
		},
		"0420": {
			"y": "求嗣.出行.解除.订盟.纳采.嫁娶.会亲友.进人口.安床.开市.交易.纳畜.牧养.入殓.除服.成服.移柩.安葬.启攒.",
			"j": "祈福.开市.修造.动土.破土.谢土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲丙子",
			"ts": "仓库碓外西北"
		},
		"0421": {
			"y": "祭祀.作灶.平治道涂.余事勿取.",
			"j": "嫁娶.安葬.动土.安床.治病.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲丁丑",
			"ts": "房床厕外西北"
		},
		"0422": {
			"y": "造车器.祭祀.祈福.求嗣.斋醮.开市.交易.安机械.雕刻.开光.造屋.合脊.起基.定磉.安门.纳畜.安葬.开生坟.立碑.谢土.斋醮.",
			"j": "入宅.动土.开仓.出货财.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲戊寅",
			"ts": "占门炉外西北"
		},
		"0424": {
			"y": "祭祀.沐浴.破屋.坏垣.求医.治病.解除.余事勿取.",
			"j": "嫁娶.开市.交易.入宅.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲庚辰",
			"ts": "厨灶栖外西北"
		},
		"0428": {
			"y": "订盟.纳采.嫁娶.进人口.会亲友.交易.立券.动土.除服.谢土.移柩.破土.启攒.赴任.出行.开市.纳财.栽种.",
			"j": "入殓.安葬.入宅.安床.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "开",
			"zc": "正冲正冲甲申",
			"ts": "碓磨炉外正北"
		},
		"0429": {
			"y": "祭祀.祈福.裁衣.合帐.安床.入殓.除服.成服.移柩.破土.启攒.安葬.谢土.立碑.造畜椆栖.",
			"j": "掘井.安门.嫁娶.纳采.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲乙酉",
			"ts": "厨灶门外正北"
		},
		"0430": {
			"y": "祭祀.进人口.嫁娶.安床.解除.冠笄.出行.裁衣.扫舍.",
			"j": "掘井.动土.破土.安葬.开光.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲丙戌",
			"ts": "仓库栖外正北"
		},
		"0524": {
			"y": "余事勿取.",
			"j": "余事勿取.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲庚戌",
			"ts": "厨灶栖外正东"
		},
		"0529": {
			"y": "嫁娶.纳采.出行.祭祀.祈福.开市.动土.移徙.入宅.破土.安葬.",
			"j": "安门.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲乙卯",
			"ts": "厨灶门外东南"
		},
		"0519": {
			"y": "祭祀.沐浴.解除.破屋.坏垣.余事勿取.",
			"j": "行丧.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲乙巳",
			"ts": "厨灶床外东北"
		},
		"0522": {
			"y": "栽种.捕捉.畋猎.余事勿取.",
			"j": "开市.动土.祭祀.斋醮.安葬.探病.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲戊申",
			"ts": "占门炉外东北"
		},
		"0516": {
			"y": "祭祀.沐浴.移徙.破土.安葬.扫舍.平治道涂.",
			"j": "祈福.嫁娶.入宅.安床.作灶.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "平",
			"zc": "正冲正冲壬寅",
			"ts": "房床炉房内东"
		},
		"0512": {
			"y": "嫁娶.冠笄.祭祀.出行.移徙.入宅.作灶.造车器.补垣.塞穴.作厕.破土.启攒.除服.成服.入殓.",
			"j": "入宅.造屋.造桥.安门.安葬.上梁.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲戊戌",
			"ts": "门鸡栖房内东"
		},
		"0502": {
			"y": "祭祀.会亲友.开市.安床.启攒.安葬.",
			"j": "嫁娶.动土.破土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"0528": {
			"y": "开光.出行.嫁娶.",
			"j": "会亲友.进人口.修造.动土.起基.移徙.开市.纳畜.入殓.除服.成服.移柩.破土.安葬.修坟.立碑.会亲友.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "平",
			"zc": "正冲正冲甲寅",
			"ts": "碓磨炉外东南"
		},
		"0518": {
			"y": "嫁娶.纳采.订盟.斋醮.开光.祭祀.祈福.求医.治病.会亲友.动土.解除.捕捉.纳畜.牧养.入殓.破土.安葬.",
			"j": "移徙.入宅.造屋.架马.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲甲辰",
			"ts": "碓磨栖外东北"
		},
		"0521": {
			"y": "开市.交易.立券.安机械.会亲友.开光.求医.治病.造屋.起基.修造.动土.定磉.竖柱.上梁.安门.作灶.放水.作厕.开池.栽种.牧养.造畜椆栖.破土.安葬.立碑.",
			"j": "嫁娶.出火.移徙.入宅.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲丁未",
			"ts": "房床厕外东北"
		},
		"0508": {
			"y": "订盟.纳采.嫁娶.解除.祭祀.祈福.求嗣.开光.出行.解除.出火.拆卸.入宅.移徙.安床.栽种.纳畜.动土.破土.谢土.安葬.修坟.",
			"j": "作灶.开市.经络.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲甲午",
			"ts": "占碓磨房内南"
		},
		"0527": {
			"y": "进人口.牧养.置产.塞穴.结网.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "满",
			"zc": "正冲正冲癸丑",
			"ts": "占门厕外正东"
		},
		"0621": {
			"y": "开光.求嗣.出行.冠笄.嫁娶.伐木.架马.开柱眼.修造.移徙.入宅.开市.交易.立券.出行.安香.出火.挂匾.起基.修造.开生坟.合寿木.入殓.除服.成服.移柩.安葬.",
			"j": "安床.出货财.作灶.动土.破土.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲戊寅",
			"ts": "占门炉外西北"
		},
		"0501": {
			"y": "纳采.开光.求医.治病.动土.上梁.移徙.入宅.",
			"j": "嫁娶.开市.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"0503": {
			"y": "祭祀.作灶.掘井.平治道涂.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"0504": {
			"y": "祭祀.斋醮.开市.动土.入殓.破土.安葬.",
			"j": "嫁娶.移徙.入宅.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"0505": {
			"y": "开市.交易.立券.挂匾.祭祀.祈福.斋醮.出行.开市.交易.立券.造屋.起基.修造.动土.定磉.安床.安机械.安葬.破土.启攒.除服.成服.立碑.",
			"j": "作灶.嫁娶.移徙.入宅.理发.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		},
		"0506": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.求嗣.开光.出火.出行.拆卸.动土.修造.进人口.入宅.移徙.安床.解除.挂匾.栽种.破土.谢土.入殓.移柩.安葬.",
			"j": "开市.立券.造船.合寿木.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲壬辰",
			"ts": "房床栖房内南"
		},
		"0507": {
			"y": "祭祀.沐浴.解除.破屋.坏垣.余事勿取.",
			"j": "开光.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲癸巳",
			"ts": "占门床房内南"
		},
		"0509": {
			"y": "祭祀.祈福.求嗣.开光.订盟.纳采.解除.动土.起基.进人口.开市.交易.立券.纳财.造仓.开池.栽种.纳畜.破土.安葬.",
			"j": "安床.上梁.裁衣.入宅.嫁娶.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲乙未",
			"ts": "厨灶厕房内南"
		},
		"0510": {
			"y": "祭祀.结网.捕捉.余事勿取.",
			"j": "探病.嫁娶.开市.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲丙申",
			"ts": "仓库炉房内南"
		},
		"0511": {
			"y": "祭祀.祈福.求嗣.开光.纳采.订盟.嫁娶.出行.动土.破土.会亲友.开市.交易.立券.习艺.拆卸.起基.安碓硙.放水.开池.造仓.开渠.栽种.谢土.启攒.修坟.立碑.",
			"j": "入宅.安门.安葬.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲丁酉",
			"ts": "房床门房内南"
		},
		"0513": {
			"y": "祭祀.解除.断蚁.会亲友.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲己亥",
			"ts": "碓磨床房内东"
		},
		"0514": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.治病.造车器.修造.动土.移徙.入宅.",
			"j": "开市.出行.安床.作灶.安葬.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲庚子",
			"ts": "厨灶碓房内东"
		},
		"0515": {
			"y": "嫁娶.纳采.订盟.会亲友.安机械.结网.冠笄.祭祀.求嗣.进人口.经络.",
			"j": "开市.作灶.动土.行丧.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "满",
			"zc": "正冲正冲辛丑",
			"ts": "仓库厕房内东"
		},
		"0517": {
			"y": "祭祀.祈福.斋醮.求嗣.安机械.纳畜.移徙.入宅.安机械.塑绘.开光.起基.竖柱.上梁.作灶.安门.安香.出火.造屋.启攒.安葬.",
			"j": "动土.破土.嫁娶.嫁娶.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲癸卯",
			"ts": "占大门外东北"
		},
		"0520": {
			"y": "沐浴.扫舍.余事勿取.",
			"j": "斋醮.开市.嫁娶.作灶.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲丙午",
			"ts": "仓库碓外东北"
		},
		"0523": {
			"y": "嫁娶.祭祀.祈福.求嗣.斋醮.订盟.纳采.解除.出行.动土.破土.习艺.针灸.理发.会亲友.起基.修造.动土.竖柱.定磉.安床.拆卸.纳畜.牧养.放水.破土.除服.成服.修坟.立碑.",
			"j": "开市.入宅.探病.出火.造屋.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲己酉",
			"ts": "碓磨门外正东"
		},
		"0525": {
			"y": "塞穴.断蚁.结网.余事勿取.",
			"j": "破土.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲辛亥",
			"ts": "仓库床外正东"
		},
		"0530": {
			"y": "嫁娶.纳采.求医.治病.修造.动土.移徙.入宅.破土.安葬.",
			"j": "开市.开光.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲丙辰",
			"ts": "仓库栖外东南"
		},
		"0531": {
			"y": "祭祀.破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲丁巳",
			"ts": "占房床外东南"
		},
		"0611": {
			"y": "嫁娶.纳采.祭祀.祈福.出行.立券.移徙.入宅.动土.破土.安葬.",
			"j": "开光.作灶.造屋.架马.开仓.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲戊辰",
			"ts": "门鸡栖外西南"
		},
		"0613": {
			"y": "祭祀.沐浴.破屋.坏垣.余事勿取.",
			"j": "入宅.嫁娶.移徙.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "破",
			"zc": "正冲正冲庚午",
			"ts": "厨灶碓外西南"
		},
		"0623": {
			"y": "安机械.移徙.入宅.出行.祭祀.祈福.斋醮.纳采.订盟.安香.出火.解除.会亲友.修造.动土.拆卸.起基.定磉.移徙.入宅.造屋.安床.修造.破土.安葬.入殓.立碑.",
			"j": "开市.伐木.作梁.作灶.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲庚辰",
			"ts": "厨灶栖外西北"
		},
		"0622": {
			"y": "祭祀.沐浴.理发.嫁娶.作灶.整手足甲.扫舍.修饰垣墙.平治道涂.",
			"j": "斋醮.出行.治病.合寿木.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲己卯",
			"ts": "占门炉外西北"
		},
		"0612": {
			"y": "纳采.订盟.冠笄.祭祀.祈福.斋醮.出行.修造.动土.移徙.入宅.安香.出火.拆卸.造屋.起基.竖柱.上梁.定磉.安门.开池.",
			"j": "嫁娶.开市.合寿木.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲己巳",
			"ts": "碓磨床外西南"
		},
		"0731": {
			"y": "纳采.祭祀.祈福.解除.动土.破土.安葬.",
			"j": "嫁娶.移徙.入宅.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲戊午",
			"ts": "占门碓外东南"
		},
		"0601": {
			"y": "嫁娶.纳采.祭祀.祈福.出行.动土.上梁.移徙.入宅.破土.安葬.",
			"j": "祈福.斋醮.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲戊午",
			"ts": "占门碓外东南"
		},
		"0602": {
			"y": "纳采.祭祀.祈福.开市.求医.治病.动土.纳畜.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲己未",
			"ts": "碓磨厕外东南"
		},
		"0603": {
			"y": "嫁娶.纳采.出行.移徙.入宅.",
			"j": "动土.破土.安葬.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲庚申",
			"ts": "厨灶炉外正南"
		},
		"0604": {
			"y": "订盟.纳采.祭祀.动土.破土.交易.立券.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲辛酉",
			"ts": "仓库门外正南"
		},
		"0605": {
			"y": "嫁娶.裁衣.祭祀.出行.安床.作灶.移徙.入宅.破土.安葬.",
			"j": "赴任.捕捉.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲壬戌",
			"ts": "房床栖外正南"
		},
		"0606": {
			"y": "嫁娶.合帐.裁衣.冠笄.伐木.上梁.出火.拆卸.移徙.修造.动土.安门.纳财.筑堤.栽种.塞穴.",
			"j": "安床.祈福.出行.安葬.行丧.开光.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲癸亥",
			"ts": "占门床外正南"
		},
		"0607": {
			"y": "出行.教牛马.割蜜.余事勿取.",
			"j": "斋醮.造屋.动土.破土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲甲子",
			"ts": "占碓磨外正南"
		},
		"0608": {
			"y": "嫁娶.祭祀.祈福.求嗣.开光.出行.解除.出火.拆卸.修造.进人口.入宅.移徙.动土.安床.纳畜.栽种.纳财.交易.立券.挂匾.造畜椆栖.",
			"j": "安葬.开生坟.合寿木.行丧.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲乙丑",
			"ts": "厨灶厕外西南"
		},
		"0609": {
			"y": "安机械.祭祀.祈福.求嗣.沐浴.解除.纳采.开市.修造.竖柱.上梁.开柱眼.安碓硙.归岫.补垣.塞穴.拆卸.放水.出火.扫舍.开生坟.合寿木.安葬.谢土.启攒.除服.成服.",
			"j": "嫁娶.安床.作灶.动土.破土.造船.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲丙寅",
			"ts": "仓库炉外西南"
		},
		"0610": {
			"y": "祭祀.沐浴.理发.整手足甲.修饰垣墙.平治道涂.余事勿取.",
			"j": "开市.入宅.出行.修造.词讼.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲丁卯",
			"ts": "房床门外西南"
		},
		"0614": {
			"y": "嫁娶.安机械.交易.出行.祭祀.祈福.求嗣.斋醮.塑绘.开光.合帐.裁衣.放水.开池.掘井.",
			"j": "作灶.理发.造桥.行丧.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "危",
			"zc": "正冲正冲辛未",
			"ts": "仓库厕外西南"
		},
		"0615": {
			"y": "纳采.冠笄.求医.治病.开市.立券.修造.动土.安机械.破土.安葬.",
			"j": "斋醮.祭祀.移徙.入宅.上梁.嫁娶.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "成",
			"zc": "正冲正冲壬申",
			"ts": "房床厕外正南"
		},
		"0616": {
			"y": "祭祀.作灶.余事勿取.",
			"j": "开市.安葬.破土.修坟.掘井.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "收",
			"zc": "正冲正冲癸酉",
			"ts": "占门厕外正南"
		},
		"0617": {
			"y": "祭祀.祈福.求嗣.斋醮.安香.解除.移徙.入宅.会亲友.求医.治病.动土.破土.开生坟.合寿木.",
			"j": "合帐.上梁.经络.安葬.入殓.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "开",
			"zc": "正冲正冲甲戌",
			"ts": "碓磨栖外正西"
		},
		"0618": {
			"y": "嫁娶.冠笄.修造.动土.作灶.移徙.入宅.补垣.塞穴.纳畜.牧养.架马.修造.动土.起基.定磉.开池.造船.",
			"j": "祈福.开光.掘井.开市.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲乙亥",
			"ts": "厨灶床外正西"
		},
		"0619": {
			"y": "祭祀.交易.纳财.",
			"j": "斋醮.开渠.上梁.动土.破土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲丙子",
			"ts": "仓库碓外西北"
		},
		"0620": {
			"y": "嫁娶.订盟.纳采.冠笄.会亲友.安机械.造车器.祭祀.出行.纳财.入宅.安香.出火.入学.塑绘.开光.拆卸.起基.修造.动土.牧养.栽种.安门.作厕.",
			"j": "行丧.伐木.作梁.作灶.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲丁丑",
			"ts": "房床厕外西北"
		},
		"0624": {
			"y": "祭祀.沐浴.捕捉.结网.畋猎.取渔.余事勿取.",
			"j": "开市.交易.嫁娶.安葬.行丧.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲辛巳",
			"ts": "仓库床外西北"
		},
		"0625": {
			"y": "破屋.坏垣.求医.治病.畋猎.余事勿取.",
			"j": "嫁娶.入宅.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "破",
			"zc": "正冲正冲壬午",
			"ts": "房床碓外正北"
		},
		"0626": {
			"y": "嫁娶.出行.安机械.祭祀.塑绘.开光.治病.经络.安床.结网.塞穴.破土.入殓.",
			"j": "开市.安门.掘井.作灶.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "危",
			"zc": "正冲正冲癸未",
			"ts": "占门厕外正北"
		},
		"0627": {
			"y": "订盟.纳采.会亲友.进人口.雕刻.拆卸.修造.动土.起基.开市.栽种.纳畜.牧养.入殓.除服.成服.移柩.破土.安葬.",
			"j": "",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "成",
			"zc": "正冲正冲甲申",
			"ts": "碓磨炉外正北"
		},
		"0628": {
			"y": "祭祀.捕捉.取渔.修饰垣墙.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "收",
			"zc": "正冲正冲乙酉",
			"ts": "厨灶门外正北"
		},
		"0629": {
			"y": "嫁娶.纳采.祭祀.祈福.求医.治病.出行.动土.移徙.入宅.",
			"j": "开市.安门.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "开",
			"zc": "正冲正冲丙戌",
			"ts": "仓库栖外正北"
		},
		"0630": {
			"y": "裁衣.作灶.移徙.入宅.纳畜.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"0728": {
			"y": "塑绘.出行.冠笄.嫁娶.进人口.裁衣.纳婿.造畜椆栖.交易.立券.牧养.开生坟.入殓.除服.成服.移柩.安葬.启攒.",
			"j": "",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "满",
			"zc": "正冲正冲乙卯",
			"ts": "厨灶门外东南"
		},
		"0831": {
			"y": "嫁娶.祭祀.祈福.斋醮.作灶.移徙.入宅.",
			"j": "动土.破土.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"0701": {
			"y": "祭祀.入殓.移柩.启攒.安葬.",
			"j": "上梁.动土.破土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"0702": {
			"y": "订盟.纳采.出行.祈福.斋醮.安床.会亲友.",
			"j": "移徙.入宅.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"0703": {
			"y": "嫁娶.纳采.出行.求医.治病.开市.移徙.入宅.启攒.安葬.",
			"j": "动土.破土.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"0704": {
			"y": "嫁娶.祭祀.沐浴.扫舍.修饰垣墙.",
			"j": "行丧.安葬.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		},
		"0705": {
			"y": "嫁娶.订盟.纳采.出行.开市.祭祀.祈福.动土.移徙.入宅.破土.安葬.",
			"j": "作灶.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲壬辰",
			"ts": "房床栖房内南"
		},
		"0706": {
			"y": "订盟.纳采.出行.祭祀.祈福.修造.动土.移徙.入宅.",
			"j": "开市.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲癸巳",
			"ts": "占门床房内南"
		},
		"0707": {
			"y": "祭祀.祈福.解除.整手足甲.安床.沐浴.入殓.移柩.破土.启攒.安葬.谢土.",
			"j": "嫁娶.斋醮.开市.出火.入宅.移徙.出行.作灶.安门.伐木.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲甲午",
			"ts": "占碓磨房内南"
		},
		"0708": {
			"y": "破屋.坏垣.解除.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲乙未",
			"ts": "厨灶厕房内南"
		},
		"0709": {
			"y": "嫁娶.开市.立券.移徙.入宅.安机械.会亲友.经络.安门.安床.挂匾.拆卸.开仓.出货财.开池.栽种.纳畜.牧养.破土.安葬.启攒.移柩.入殓.立碑.",
			"j": "祭祀.祈福.探病.谢土.造桥.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲丙申",
			"ts": "仓库炉房内南"
		},
		"0710": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.斋醮.开光.会亲友.求医.治病.造屋.起基.竖柱.上梁.安门.安碓硙.筑堤.开池.破土.安葬.除服.成服.",
			"j": "入宅.开市.掘井.词讼.合寿木.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲丁酉",
			"ts": "房床门房内南"
		},
		"0711": {
			"y": "纳采.订盟.嫁娶.移徙.入宅.出行.祭祀.祈福.斋醮.塑绘.开光.安香.出火.会亲友.解除.入学.竖柱.上梁.拆卸.造屋.起基.栽种.牧养.纳畜.",
			"j": "安葬.破土.开市.开仓.出货财.启攒.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲戊戌",
			"ts": "门鸡栖房内东"
		},
		"0712": {
			"y": "纳采.订盟.嫁娶.祭祀.沐浴.塑绘.开光.出火.治病.习艺.伐木.造屋.竖柱.上梁.安床.作灶.安碓硙.挂匾.掘井.纳畜.",
			"j": "出行.安葬.造桥.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲己亥",
			"ts": "碓磨床房内东"
		},
		"0713": {
			"y": "祭祀.入殓.除服.成服.移柩.破土.启攒.安葬.塞穴.断蚁.结网.",
			"j": "开市.入宅.嫁娶.开光.造屋.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲庚子",
			"ts": "厨灶碓房内东"
		},
		"0714": {
			"y": "祭祀.修造.出行.造屋.竖柱.造车器.教牛马.造畜椆栖.割蜜.",
			"j": "动土.破土.掘井.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "建",
			"zc": "正冲正冲辛丑",
			"ts": "仓库厕房内东"
		},
		"0715": {
			"y": "祭祀.沐浴.塑绘.开光.入学.解除.扫舍.治病.开池.牧养.",
			"j": "嫁娶.出行.纳采.入宅.作灶.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "除",
			"zc": "正冲正冲壬寅",
			"ts": "房床炉房内东"
		},
		"0716": {
			"y": "纳财.开市.交易.立券.出行.祭祀.祈福.求嗣.开光.解除.扫舍.起基.竖柱.安床.移徙.开仓.出货财.补垣.塞穴.栽种.纳畜.牧养.",
			"j": "斋醮.入宅.安门.安葬.破土.行丧.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "满",
			"zc": "正冲正冲癸卯",
			"ts": "占大门外东北"
		},
		"0717": {
			"y": "祭祀.修饰垣墙.平治道涂.",
			"j": "开市.动土.破土.嫁娶.修造.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "平",
			"zc": "正冲正冲甲辰",
			"ts": "碓磨栖外东北"
		},
		"0718": {
			"y": "订盟.纳采.祭祀.祈福.开光.安香.出火.立券.安机械.移徙.入宅.竖柱.上梁.会亲友.安床.拆卸.挂匾.牧养.教牛马.",
			"j": "嫁娶.安葬.行丧.破土.修坟.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲乙巳",
			"ts": "厨灶床外东北"
		},
		"0719": {
			"y": "沐浴.理发.捕捉.入殓.移柩.破土.启攒.安葬.",
			"j": "出火.嫁娶.入宅.作灶.破土.上梁.动土.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲丙午",
			"ts": "仓库碓外东北"
		},
		"0720": {
			"y": "求医.治病.破屋.坏垣.余事勿取.",
			"j": "嫁娶.出行.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲丁未",
			"ts": "房床厕外东北"
		},
		"0721": {
			"y": "纳采.订盟.嫁娶.移徙.入宅.出行.开市.交易.立券.纳财.会亲友.安香.出火.拆卸.造屋.起基.安床.作灶.挂匾.安葬.破土.启攒.立碑.入殓.移柩.",
			"j": "祈福.上梁.开仓.掘井.牧养.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲戊申",
			"ts": "占门炉外东北"
		},
		"0722": {
			"y": "祭祀.祈福.斋醮.出行.纳采.订盟.安机械.出火.拆卸.修造.动土.起基.移徙.入宅.造庙.入殓.除服.成服.移柩.破土.安葬.谢土.",
			"j": "嫁娶.开市.栽种.合寿木.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲己酉",
			"ts": "碓磨门外正东"
		},
		"0723": {
			"y": "祭祀.进人口.纳财.纳畜.牧养.捕捉.余事勿取.",
			"j": "开市.入宅.安床.动土.安葬.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲庚戌",
			"ts": "厨灶栖外正东"
		},
		"0724": {
			"y": "祭祀.塑绘.开光.求医.治病.嫁娶.会亲友.放水.掘井.牧养.纳畜.开渠.安碓硙.",
			"j": "造屋.入宅.作灶.入学.安葬.行丧.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲辛亥",
			"ts": "仓库床外正东"
		},
		"0725": {
			"y": "祭祀.塞穴.结网.畋猎.余事勿取.",
			"j": "移徙.开市.入宅.嫁娶.开光.安门.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲壬子",
			"ts": "房床碓外正东"
		},
		"0726": {
			"y": "开市.纳财.祭祀.塑绘.安机械.冠笄.会亲友.裁衣.开仓.经络.纳畜.造畜椆栖.教牛马.牧养.",
			"j": "动土.破土.安葬.治病.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "建",
			"zc": "正冲正冲癸丑",
			"ts": "占门厕外正东"
		},
		"0727": {
			"y": "移徙.入宅.治病.会亲友.祭祀.祈福.斋醮.安香.移徙.嫁娶.造屋.起基.",
			"j": "开市.斋醮.安床.出行.经络.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "除",
			"zc": "正冲正冲甲寅",
			"ts": "碓磨炉外东南"
		},
		"0729": {
			"y": "祭祀.冠笄.嫁娶.捕捉.结网.畋猎.取渔.余事勿取.",
			"j": "余事勿取.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "平",
			"zc": "正冲正冲丙辰",
			"ts": "仓库栖外东南"
		},
		"0730": {
			"y": "沐浴.扫舍.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲丁巳",
			"ts": "占房床外东南"
		},
		"0801": {
			"y": "祭祀.破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲己未",
			"ts": "碓磨厕外东南"
		},
		"0802": {
			"y": "嫁娶.纳采.开市.出行.动土.上梁.移徙.入宅.破土.安葬.",
			"j": "祭祀.祈福.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲庚申",
			"ts": "厨灶炉外正南"
		},
		"0803": {
			"y": "嫁娶.纳采.开市.出行.动土.上梁.移徙.入宅.破土.安葬.",
			"j": "赴任.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲辛酉",
			"ts": "仓库门外正南"
		},
		"0804": {
			"y": "祭祀.作灶.纳财.捕捉.",
			"j": "开市.破土.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲壬戌",
			"ts": "房床栖外正南"
		},
		"0805": {
			"y": "嫁娶.开市.立券.祭祀.祈福.动土.移徙.入宅.",
			"j": "造庙.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲癸亥",
			"ts": "占门床外正南"
		},
		"0806": {
			"y": "补垣.塞穴.结网.入殓.除服.成服.移柩.安葬.启攒.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲甲子",
			"ts": "占碓磨外正南"
		},
		"0807": {
			"y": "祭祀.出行.作梁.出火.拆卸.修造.动土.起基.安床.补垣.塞穴.入殓.破土.安葬.移柩.造畜椆栖.",
			"j": "嫁娶.入宅.斋醮.开光.针灸.掘井.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲乙丑",
			"ts": "厨灶厕外西南"
		},
		"0808": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.求嗣.出行.解除.竖柱.入宅.移徙.纳财.上梁.纳畜.入殓.安葬.启攒.",
			"j": "栽种.掘井.动土.安床.破土.置产.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲丙寅",
			"ts": "仓库炉外西南"
		},
		"0809": {
			"y": "解除.祭祀.祈福.求嗣.修造.动土.竖柱.上梁.安床.纳畜.造屋.合脊.起基.入殓.破土.安葬.",
			"j": "出火.嫁娶.开光.进人口.出行.词讼.开市.入宅.移徙.赴任.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲丁卯",
			"ts": "房床门外西南"
		},
		"0810": {
			"y": "沐浴.理发.会亲友.塑绘.开光.栽种.牧养.嫁娶.经络.补垣.塞穴.",
			"j": "开市.入宅.动土.破土.安葬.作灶.上梁.安床.开仓.祈福.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲戊辰",
			"ts": "门鸡栖外西南"
		},
		"0811": {
			"y": "祭祀.理发.作灶.沐浴.修饰垣墙.平治道涂.",
			"j": "嫁娶.栽种.祈福.造桥.安葬.安门.伐木.作梁.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲己巳",
			"ts": "碓磨床外西南"
		},
		"0812": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.斋醮.普渡.移徙.入宅.出行.安机械.开光.修造.动土.竖柱.上梁.造屋.起基.定磉.安门.安葬.破土.",
			"j": "开市.立券.置产.作灶.造桥.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲庚午",
			"ts": "厨灶碓外西南"
		},
		"0813": {
			"y": "祭祀.普渡.捕捉.解除.结网.畋猎.入殓.破土.安葬.",
			"j": "开市.交易.入宅.嫁娶.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲辛未",
			"ts": "仓库厕外西南"
		},
		"0814": {
			"y": "沐浴.破屋.坏垣.余事勿取.",
			"j": "斋醮.开市.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲壬申",
			"ts": "房床厕外正南"
		},
		"0815": {
			"y": "订盟.纳采.祭祀.祈福.安香.出火.开市.立券.入宅.挂匾.造桥.启攒.安葬.",
			"j": "动土.破土.嫁娶.掘井.安床.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲癸酉",
			"ts": "占门厕外正南"
		},
		"0816": {
			"y": "嫁娶.祭祀.祈福.斋醮.普渡.移徙.入宅.动土.治病.开市.交易.立券.开光.修造.造车器.安香.安床.捕捉.畋猎.结网.",
			"j": "纳采.订盟.经络.行丧.安葬.探病.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲甲戌",
			"ts": "碓磨栖外正西"
		},
		"0817": {
			"y": "嫁娶.订盟.纳采.作灶.冠笄.裁衣.会亲友.纳畜.牧养.安机械.开市.立券.纳财.安床.",
			"j": "掘井.出行.破土.行丧.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲乙亥",
			"ts": "厨灶床外正西"
		},
		"0818": {
			"y": "嫁娶.订盟.纳采.祭祀.斋醮.普渡.解除.出行.会亲友.开市.纳财.修造.动土.竖柱.上梁.开光.开仓.出货财.纳畜.牧养.开池.破土.启攒.",
			"j": "出火.入宅.造屋.安门.安葬.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "开",
			"zc": "正冲正冲丙子",
			"ts": "仓库碓外西北"
		},
		"0819": {
			"y": "嫁娶.普渡.祭祀.祈福.补垣.塞穴.断蚁.筑堤.入殓.除服.成服.安葬.",
			"j": "动土.破土.掘井.开光.上梁.词讼.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲丁丑",
			"ts": "房床厕外西北"
		},
		"0820": {
			"y": "嫁娶.冠笄.祭祀.沐浴.普渡.出行.纳财.扫舍.纳畜.赴任.",
			"j": "开市.动土.破土.安床.开仓.上梁.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲戊寅",
			"ts": "占门炉外西北"
		},
		"0821": {
			"y": "祭祀.沐浴.理发.整手足甲.冠笄.解除.入殓.移柩.破土.启攒.安葬.",
			"j": "嫁娶.出行.入宅.开市.安门.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲己卯",
			"ts": "占门炉外西北"
		},
		"0822": {
			"y": "塑绘.冠笄.嫁娶.会亲友.进人口.经络.裁衣.栽种.纳畜.牧养.补垣.塞穴.捕捉.",
			"j": "祈福.开市.动土.行丧.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲庚辰",
			"ts": "厨灶栖外西北"
		},
		"0823": {
			"y": "出行.沐浴.订盟.纳采.裁衣.竖柱.上梁.移徙.纳畜.牧养.",
			"j": "嫁娶.安门.动土.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲辛巳",
			"ts": "仓库床外西北"
		},
		"0824": {
			"y": "纳采.订盟.嫁娶.祭祀.祈福.普渡.开光.安香.出火.移徙.入宅.竖柱.修造.动土.竖柱.上梁.起基.造屋.安门.造庙.造桥.破土.启攒.安葬.",
			"j": "开市.立券.纳财.作灶.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲壬午",
			"ts": "房床碓外正北"
		},
		"0825": {
			"y": "祭祀.捕捉.畋猎.纳畜.牧养.入殓.除服.成服.移柩.破土.安葬.启攒.",
			"j": "嫁娶.纳采.订盟.开市.入宅.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲癸未",
			"ts": "占门厕外正北"
		},
		"0826": {
			"y": "破屋.坏垣.治病.余事勿取.",
			"j": "行丧.安葬.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲甲申",
			"ts": "碓磨炉外正北"
		},
		"0827": {
			"y": "祈福.斋醮.出行.冠笄.嫁娶.雕刻.开柱眼.入宅.造桥.开市.交易.立券.纳财.入殓.除服.成服.移柩.破土.安葬.启攒.",
			"j": "动土.破土.订盟.安床.开池.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲乙酉",
			"ts": "厨灶门外正北"
		},
		"0828": {
			"y": "祈福.求嗣.解除.订盟.纳采.动土.起基.放水.造仓.开市.纳畜.牧养.开生坟.入殓.除服.成服.移柩.破土.安葬.",
			"j": "",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲丙戌",
			"ts": "仓库栖外正北"
		},
		"0829": {
			"y": "塑绘.开光.解除.订盟.纳采.嫁娶.出火.修造.动土.移徙.入宅.拆卸.起基.安门.分居.开市.交易.立券.纳财.纳畜.牧养.",
			"j": "",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"0830": {
			"y": "祈福.出行.订盟.纳采.嫁娶.裁衣.动土.安床.放水.开市.掘井.交易.立券.栽种.开渠.除服.成服.移柩.破土.",
			"j": "",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "开",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"0921": {
			"y": "订盟.纳采.祭祀.祈福.安香.出火.修造.动土.上梁.安门.起基.竖柱.上梁.定磉.开池.移徙.入宅.立券.破土.",
			"j": "嫁娶.造庙.造桥.造船.作灶.安葬.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲庚戌",
			"ts": "厨灶栖外正东"
		},
		"0925": {
			"y": "祭祀.出行.解除.冠笄.嫁娶.伐木.架马.开柱眼.修造.动土.移徙.入宅.开生坟.合寿木.入殓.移柩.破土.安葬.修坟.",
			"j": "开光.安床.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲甲寅",
			"ts": "碓磨炉外东南"
		},
		"0930": {
			"y": "祭祀.会亲友.纳采.嫁娶.开光.塑绘.斋醮.安香.开市.立券.除服.成服.入殓.移柩.安葬.赴任.进人口.出行.裁衣.修造.动土.上梁.经络.交易.",
			"j": "入宅.伐木.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲己未",
			"ts": "碓磨厕外东南"
		},
		"0926": {
			"y": "祭祀.祈福.求嗣.出行.沐浴.交易.扫舍.教牛马.",
			"j": "动土.作灶.行丧.安葬.修坟.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲乙卯",
			"ts": "厨灶门外东南"
		},
		"0920": {
			"y": "余事勿取.",
			"j": "探病.余事勿取.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲己酉",
			"ts": "碓磨门外正东"
		},
		"1031": {
			"y": "祭祀.祈福.斋醮.沐浴.竖柱.订盟.纳采.嫁娶.拆卸.入宅.移柩.启攒.谢土.赴任.出火.纳畜.",
			"j": "作灶.入殓.安葬.安床.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "开",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"0901": {
			"y": "嫁娶.出行.纳畜.祭祀.入殓.启攒.安葬.",
			"j": "作灶.动土.破土.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"0902": {
			"y": "订盟.纳采.祭祀.祈福.修造.动土.上梁.破土.安葬.",
			"j": "嫁娶.开市.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		},
		"0903": {
			"y": "订盟.纳采.出行.会亲友.修造.上梁.移徙.入宅.",
			"j": "开市.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲壬辰",
			"ts": "房床栖房内南"
		},
		"0904": {
			"y": "沐浴.修饰垣墙.平治道涂.余事勿取.",
			"j": "嫁娶.祈福.余事勿取.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲癸巳",
			"ts": "占门床房内南"
		},
		"0905": {
			"y": "嫁娶.祭祀.祈福.斋醮.动土.移徙.入宅.",
			"j": "开市.安葬.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲甲午",
			"ts": "占碓磨房内南"
		},
		"0906": {
			"y": "捕捉.结网.入殓.破土.安葬.",
			"j": "嫁娶.入宅.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲乙未",
			"ts": "厨灶厕房内南"
		},
		"0907": {
			"y": "沐浴.治病.破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲丙申",
			"ts": "仓库炉房内南"
		},
		"0908": {
			"y": "破屋.坏垣.求医.治病.余事勿取.",
			"j": "移徙.入宅.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲丁酉",
			"ts": "房床门房内南"
		},
		"0909": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.求嗣.开光.出行.出火.拆卸.修造.动土.进人口.入宅.移徙.安床.上梁.合脊.放水.掘井.破土.移柩.谢土.除服.成服.",
			"j": "开市.开仓.安门.安葬.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲戊戌",
			"ts": "门鸡栖房内东"
		},
		"0910": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.求嗣.开光.解除.进人口.入宅.移徙.出火.安床.开市.交易.立券.挂匾.",
			"j": "安葬.纳畜.出行.行丧.伐木.栽种.造庙.造桥.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲己亥",
			"ts": "碓磨床房内东"
		},
		"0911": {
			"y": "祭祀.冠笄.捕捉.余事勿取.",
			"j": "嫁娶.开市.造屋.作梁.合寿木.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲庚子",
			"ts": "厨灶碓房内东"
		},
		"0912": {
			"y": "祭祀.解除.结网.畋猎.取渔.会亲友.入学.移柩.启攒.除服.成服.",
			"j": "开市.祈福.动土.破土.入殓.安葬.造船.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲辛丑",
			"ts": "仓库厕房内东"
		},
		"0913": {
			"y": "冠笄.沐浴.出行.修造.动土.移徙.入宅.破土.安葬.",
			"j": "嫁娶.开市.祭祀.祈福.斋醮.纳采.修坟.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲壬寅",
			"ts": "房床炉房内东"
		},
		"0914": {
			"y": "祭祀.出行.",
			"j": "嫁娶.入宅.修造.动土.会亲友.破土.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "建",
			"zc": "正冲正冲癸卯",
			"ts": "占大门外东北"
		},
		"0915": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.出行.修造.动土.移徙.入宅.",
			"j": "针灸.伐木.作梁.造庙.行丧.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲甲辰",
			"ts": "碓磨栖外东北"
		},
		"0916": {
			"y": "出行.开市.交易.立券.安机械.出火.上梁.移徙.",
			"j": "嫁娶.安葬.动土.造桥.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "满",
			"zc": "正冲正冲乙巳",
			"ts": "厨灶床外东北"
		},
		"0917": {
			"y": "祭祀.沐浴.修饰垣墙.平治道涂.余事勿取.",
			"j": "斋醮.嫁娶.移徙.出行.上梁.入宅.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "平",
			"zc": "正冲正冲丙午",
			"ts": "仓库碓外东北"
		},
		"0918": {
			"y": "嫁娶.造车器.安机械.祭祀.祈福.开光.安香.出火.出行.开市.立券.修造.动土.移徙.入宅.破土.安葬.",
			"j": "纳采.订盟.架马.词讼.开渠.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "定",
			"zc": "正冲正冲丁未",
			"ts": "房床厕外东北"
		},
		"0919": {
			"y": "沐浴.捕捉.入殓.除服.成服.破土.启攒.安葬.",
			"j": "祭祀.嫁娶.安床.开市.入宅.探病.上梁.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲戊申",
			"ts": "占门炉外东北"
		},
		"0922": {
			"y": "开光.求嗣.雕刻.嫁娶.订盟.纳采.出火.拆卸.修造.动土.起基.上梁.放水.移徙.入宅.造仓.造船.开市.开池.纳畜.牧养.挂匾.",
			"j": "行丧.安葬.合寿木.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲辛亥",
			"ts": "仓库床外正东"
		},
		"0923": {
			"y": "祭祀.嫁娶.捕捉.",
			"j": "开光.动土.破土.开市.修造.入宅.安门.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲壬子",
			"ts": "房床碓外正东"
		},
		"0924": {
			"y": "祭祀.普渡.解除.会亲友.捕捉.畋猎.启攒.除服.成服.移柩.",
			"j": "嫁娶.开市.动土.掘井.开池.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲癸丑",
			"ts": "占门厕外正东"
		},
		"0927": {
			"y": "出行.解除.纳采.冠笄.雕刻.修造.动土.起基.上梁.合脊.安床.移徙.入宅.开市.栽种.作厕.",
			"j": "造庙.安门.行丧.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "除",
			"zc": "正冲正冲丙辰",
			"ts": "仓库栖外东南"
		},
		"0928": {
			"y": "祭祀.沐浴.解除.理发.冠笄.安机械.作灶.造仓.开市.开池.作厕.补垣.塞穴.断蚁.结网.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "满",
			"zc": "正冲正冲丁巳",
			"ts": "占房床外东南"
		},
		"0929": {
			"y": "祭祀.沐浴.修饰垣墙.平治道涂.",
			"j": "嫁娶.入宅.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "平",
			"zc": "正冲正冲戊午",
			"ts": "占门碓外东南"
		},
		"1021": {
			"y": "纳采.订盟.嫁娶.祭祀.祈福.求嗣.置产.求医.治病.开市.交易.立券.会亲友.移徙.竖柱.上梁.造屋.合脊.安门.放水.捕捉.纳畜.",
			"j": "造庙.造船.动土.破土.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲庚辰",
			"ts": "厨灶栖外西北"
		},
		"1029": {
			"y": "祭祀.塑绘.开光.祈福.斋醮.出行.订盟.纳采.裁衣.嫁娶.拆卸.修造.安床.入宅.安香.入殓.启攒.安葬.谢土.赴任.会亲友.进人口.出行.移徙.上梁.经络.开市.交易.立券.纳财.",
			"j": "开仓.冠笄.伐木.作梁.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "成",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"1024": {
			"y": "祭祀.造畜椆栖.修饰垣墙.平治道涂.余事勿取.",
			"j": "嫁娶.开市.安床.掘井.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲癸未",
			"ts": "占门厕外正北"
		},
		"1014": {
			"y": "嫁娶.纳采.订盟.祭祀.祈福.求嗣.斋醮.开光.安香.出火.造庙.移徙.出行.入宅.造庙.起基.竖柱.上梁.安床.纳畜.捕捉.纳婿.安葬.",
			"j": "开市.破土.掘井.合寿木.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲癸酉",
			"ts": "占门厕外正南"
		},
		"1011": {
			"y": "纳采.订盟.开市.交易.立券.会亲友.纳畜.牧养.问名.移徙.解除.作厕.入学.起基.安床.开仓.出货财.安葬.启攒.入殓.除服.成服.",
			"j": "入宅.上梁.斋醮.出火.谢土.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲庚午",
			"ts": "厨灶碓外西南"
		},
		"1022": {
			"y": "出行.造车器.造畜椆栖.解除.冠笄.裁衣.作梁.雕刻.会亲友.移徙.入宅.安机械.造畜椆栖.开市.扫舍.",
			"j": "嫁娶.动土.破土.修坟.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲辛巳",
			"ts": "仓库床外西北"
		},
		"1027": {
			"y": "破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "破",
			"zc": "正冲正冲丙戌",
			"ts": "仓库栖外正北"
		},
		"1017": {
			"y": "造车器.嫁娶.订盟.纳采.会亲友.祭祀.出行.开市.立券.移徙.入宅.破土.安葬.",
			"j": "上梁.开光.造屋.架马.合寿木.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "成",
			"zc": "正冲正冲丙子",
			"ts": "仓库碓外西北"
		},
		"1129": {
			"y": "理发.会亲友.补垣.塞穴.结网.",
			"j": "嫁娶.入宅.安门.移徙.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "满",
			"zc": "正冲正冲己未",
			"ts": "碓磨厕外东南"
		},
		"1001": {
			"y": "祭祀.冠笄.会亲友.拆卸.起基.除服.成服.移柩.启攒.安葬.沐浴.捕捉.开光.塑绘.",
			"j": "作灶.祭祀.入宅.嫁娶.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "执",
			"zc": "正冲正冲庚申",
			"ts": "厨灶炉外正南"
		},
		"1002": {
			"y": "祭祀.沐浴.破屋.坏垣.余事勿取.",
			"j": "移徙.入宅.出行.栽种.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "破",
			"zc": "正冲正冲辛酉",
			"ts": "仓库门外正南"
		},
		"1003": {
			"y": "祭祀.塑绘.开光.出行.解除.订盟.嫁娶.拆卸.起基.安床.入宅.开市.入殓.除服.成服.移柩.破土.谢土.挂匾.开柱眼.交易.",
			"j": "造桥.冠笄.造屋.掘井.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "危",
			"zc": "正冲正冲壬戌",
			"ts": "房床栖外正南"
		},
		"1004": {
			"y": "祭祀.赴任.动土.上梁.开光.塑绘.冠笄.拆卸.起基.安床.开市.立券.赴任.经络.",
			"j": "定磉.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "成",
			"zc": "正冲正冲癸亥",
			"ts": "占门床外正南"
		},
		"1005": {
			"y": "祭祀.裁衣.冠笄.嫁娶.纳婿.会亲友.除服.成服.移柩.捕捉.进人口.入殓.",
			"j": "移徙.入宅.作灶.安葬.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "收",
			"zc": "正冲正冲甲子",
			"ts": "占碓磨外正南"
		},
		"1006": {
			"y": "祭祀.诸事不宜.",
			"j": "入殓.安葬.开市.交易.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "开",
			"zc": "正冲正冲乙丑",
			"ts": "厨灶厕外西南"
		},
		"1007": {
			"y": "祭祀.裁衣.冠笄.嫁娶.安机械.拆卸.动土.起基.移徙.入宅.入殓.启攒.安葬.造仓.经络.",
			"j": "安床.开光.开市.交易.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "闭",
			"zc": "正冲正冲丙寅",
			"ts": "仓库炉外西南"
		},
		"1008": {
			"y": "嫁娶.裁衣.冠笄.合帐.祭祀.出行.安床.移徙.塞穴.入殓.破土.移柩.安葬.",
			"j": "开市.出行.栽种.置产.词讼.安门.掘井.开光.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲丁卯",
			"ts": "房床门外西南"
		},
		"1009": {
			"y": "祭祀.造车器.出行.修造.上梁.造屋.安门.安床.造畜椆栖.教牛马.",
			"j": "出货财.开仓.动土.破土.安葬.行丧.伐木.开渠.栽种.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲戊辰",
			"ts": "门鸡栖外西南"
		},
		"1010": {
			"y": "祭祀.开光.出行.解除.伐木.作梁.出火.拆卸.入宅.移徙.安床.修造.造畜椆栖.扫舍.",
			"j": "造庙.嫁娶.掘井.栽种.造桥.作灶.动土.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲己巳",
			"ts": "碓磨床外西南"
		},
		"1012": {
			"y": "祭祀.平治道涂.余事勿取.",
			"j": "嫁娶.开市.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲辛未",
			"ts": "仓库厕外西南"
		},
		"1013": {
			"y": "捕捉.畋猎.余事勿取.",
			"j": "开市.交易.祭祀.入宅.安葬.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲壬申",
			"ts": "房床厕外正南"
		},
		"1015": {
			"y": "祭祀.沐浴.解除.破屋.坏垣.余事勿取.",
			"j": "开市.嫁娶.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "破",
			"zc": "正冲正冲甲戌",
			"ts": "碓磨栖外正西"
		},
		"1016": {
			"y": "订盟.纳采.会亲友.交易.立券.纳财.栽种.纳畜.牧养.",
			"j": "嫁娶.开市.入宅.祈福.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "危",
			"zc": "正冲正冲乙亥",
			"ts": "厨灶床外正西"
		},
		"1018": {
			"y": "祭祀.作灶.纳财.捕捉.畋猎.余事勿取.",
			"j": "动土.破土.开市.安葬.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "收",
			"zc": "正冲正冲丁丑",
			"ts": "房床厕外西北"
		},
		"1019": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.出行.求医.治病.出火.移徙.入宅.",
			"j": "开市.开仓.出货财.安床.安门.安葬.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "开",
			"zc": "正冲正冲戊寅",
			"ts": "占门炉外西北"
		},
		"1020": {
			"y": "冠笄.祭祀.沐浴.作灶.理发.整手足甲.扫舍.补垣.塞穴.入殓.破土.启攒.",
			"j": "开光.嫁娶.会亲友.栽种.针灸.安葬.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲己卯",
			"ts": "占门炉外西北"
		},
		"1023": {
			"y": "沐浴.理发.冠笄.安床.开市.立券.会亲友.交易.纳财.结网.教牛马.",
			"j": "移徙.入宅.出行.祈福.嫁娶.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲壬午",
			"ts": "房床碓外正北"
		},
		"1025": {
			"y": "捕捉.结网.入殓.除服.成服.移柩.破土.安葬.启攒.立碑.",
			"j": "嫁娶.祭祀.入宅.造屋.移徙.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲甲申",
			"ts": "碓磨炉外正北"
		},
		"1026": {
			"y": "祭祀.祈福.求嗣.斋醮.造庙.出火.安机械.会亲友.开市.交易.立券.纳财.习艺.经络.求医.治病.开池.作厕.畋猎.结网.栽种.牧养.安葬.破土.启攒.",
			"j": "开光.嫁娶.掘井.伐木.作梁.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "执",
			"zc": "正冲正冲乙酉",
			"ts": "厨灶门外正北"
		},
		"1028": {
			"y": "会亲友.嫁娶.订盟.纳采.纳婿.拆卸.修造.动土.起基.竖柱.上梁.安床.会亲友.纳财.",
			"j": "出行.祈福.安葬.作灶.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "危",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"1030": {
			"y": "祭祀.作灶.入殓.除服.成服.畋猎.",
			"j": "栽种.动土.安葬.开市.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "收",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"1121": {
			"y": "破屋.坏垣.祭祀.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲辛亥",
			"ts": "仓库床外正东"
		},
		"1229": {
			"y": "祭祀.祈福.斋醮.出行.冠笄.安机械.移徙.入宅.安香.安床.除服.成服.移柩.启攒.",
			"j": "开光.栽种.治病.安门.作灶.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲己丑",
			"ts": "碓磨厕房内北"
		},
		"1101": {
			"y": "嫁娶.祭祀.安机械.入殓.破土.安葬.",
			"j": "动土.上梁.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "闭",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		},
		"1102": {
			"y": "作灶.造畜椆栖.",
			"j": "行丧.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "建",
			"zc": "正冲正冲壬辰",
			"ts": "房床栖房内南"
		},
		"1103": {
			"y": "沐浴.理发.入学.习艺.进人口.",
			"j": "嫁娶.入宅.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "除",
			"zc": "正冲正冲癸巳",
			"ts": "占门床房内南"
		},
		"1104": {
			"y": "开光.针灸.会亲友.启攒.安葬.",
			"j": "开市.动土.破土.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "满",
			"zc": "正冲正冲甲午",
			"ts": "占碓磨房内南"
		},
		"1105": {
			"y": "祭祀.结网.造畜椆栖.余事勿取.",
			"j": "余事勿取.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "平",
			"zc": "正冲正冲乙未",
			"ts": "厨灶厕房内南"
		},
		"1106": {
			"y": "入殓.除服.成服.移柩.破土.启攒.安葬.",
			"j": "移徙.入宅.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "定",
			"zc": "正冲正冲丙申",
			"ts": "仓库炉房内南"
		},
		"1107": {
			"y": "嫁娶.纳采.订盟.祭祀.斋醮.开光.安香.出火.出行.出火.拆卸.动土.祈福.进人口.纳财.交易.立券.移徙.安床.修造.安葬.除服.成服.",
			"j": "置产.掘井.词讼.栽种.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲丁酉",
			"ts": "房床门房内南"
		},
		"1108": {
			"y": "嫁娶.纳采.订盟.祭祀.开光.出行.解除.伐木.出火.入宅.移徙.拆卸.修造.栽种.安葬.入殓.",
			"j": "破土.动土.安门.作灶.开市.交易.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲戊戌",
			"ts": "门鸡栖房内东"
		},
		"1109": {
			"y": "祭祀.解除.破屋.坏垣.求医.治病.余事勿取.",
			"j": "嫁娶.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲己亥",
			"ts": "碓磨床房内东"
		},
		"1110": {
			"y": "祭祀.扫舍.破土.安葬.除服.成服.启攒.移柩.入殓.立碑.余事勿取.",
			"j": "祭祀.嫁娶.入宅.修造.动土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲庚子",
			"ts": "厨灶碓房内东"
		},
		"1111": {
			"y": "订盟.纳采.会亲友.祭祀.祈福.修造.动土.安机械.破土.安葬.",
			"j": "嫁娶.移徙.出火.开市.入宅.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲辛丑",
			"ts": "仓库厕房内东"
		},
		"1112": {
			"y": "祭祀.沐浴.捕捉.畋猎.结网.扫舍.",
			"j": "嫁娶.纳采.订盟.安床.动土.破土.安葬.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲壬寅",
			"ts": "房床炉房内东"
		},
		"1113": {
			"y": "开市.纳财.出行.祭祀.祈福.求嗣.斋醮.问名.入学.起基.定磉.置产.开渠.掘井.拆卸.栽种.纳畜.牧养.动土.破土.启攒.",
			"j": "移徙.入宅.出火.入殓.安葬.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲癸卯",
			"ts": "占大门外东北"
		},
		"1114": {
			"y": "祭祀.理发.置产.塞穴.除服.成服.移柩.入殓.破土.安葬.",
			"j": "嫁娶.入宅.安床.掘井.开光.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲甲辰",
			"ts": "碓磨栖外东北"
		},
		"1115": {
			"y": "祭祀.沐浴.出行.余事勿取.",
			"j": "开市.动土.破土.行丧.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "建",
			"zc": "正冲正冲乙巳",
			"ts": "厨灶床外东北"
		},
		"1116": {
			"y": "嫁娶.造车器.出行.会亲友.移徙.入宅.修造.动土.雕刻.开光.安香.出火.理发.会亲友.造屋.合脊.起基.归岫.安门.拆卸.扫舍.栽种.造畜椆栖.",
			"j": "开市.纳采.造庙.安床.开渠.安葬.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "除",
			"zc": "正冲正冲丙午",
			"ts": "仓库碓外东北"
		},
		"1117": {
			"y": "塑绘.会亲友.安机械.塞穴.结网.裁衣.经络.",
			"j": "嫁娶.开市.祈福.斋醮.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "满",
			"zc": "正冲正冲丁未",
			"ts": "房床厕外东北"
		},
		"1118": {
			"y": "纳采.移徙.纳财.开市.交易.立券.纳财.入宅.修造.动土.竖柱.起基.定磉.造庙.安香.出火.修饰垣墙.平治道涂.会亲友.出行.开池.作厕.",
			"j": "开仓.造屋.造桥.祭祀.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "平",
			"zc": "正冲正冲戊申",
			"ts": "占门炉外东北"
		},
		"1119": {
			"y": "订盟.纳采.纳财.开市.立券.祭祀.祈福.移徙.入宅.出行.造屋.起基.修造.动土.竖柱.上梁.安门.安香.出火.教牛马.会亲友.破土.",
			"j": "嫁娶.安葬.掘井.置产.造船.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲己酉",
			"ts": "碓磨门外正东"
		},
		"1120": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.塑绘.开光.移徙.安床.伐木.作梁.捕捉.畋猎.结网.求医.治病.解除.安葬.除服.成服.移柩.入殓.立碑.谢土.",
			"j": "开市.造庙.动土.破土.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲庚戌",
			"ts": "厨灶栖外正东"
		},
		"1122": {
			"y": "嫁娶.纳采.订盟.祭祀.冠笄.裁衣.伐木.作梁.架马.定磉.开柱眼.作灶.移徙.安床.畋猎.结网.开池.作厕.除服.成服.启攒.入殓.移柩.安葬.",
			"j": "造屋.造船.动土.破土.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲壬子",
			"ts": "房床碓外正东"
		},
		"1123": {
			"y": "纳采.订盟.祭祀.祈福.求嗣.斋醮.开光.会亲友.解除.入学.纳财.交易.立券.经络.起基.动土.定磉.开池.栽种.纳畜.牧养.破土.入殓.立碑.安葬.",
			"j": "嫁娶.开市.入宅.出火.移徙.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲癸丑",
			"ts": "占门厕外正东"
		},
		"1124": {
			"y": "捕捉.畋猎.会亲友.解除.入殓.除服.成服.移柩.余事勿取.",
			"j": "安床.安门.破土.修坟.安葬.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲甲寅",
			"ts": "碓磨炉外东南"
		},
		"1125": {
			"y": "祭祀.祈福.求嗣.斋醮.沐浴.冠笄.出行.理发.拆卸.解除.起基.动土.定磉.安碓硙.开池.掘井.扫舍.除服.成服.移柩.启攒.立碑.谢土.",
			"j": "移徙.入宅.安门.作梁.安葬.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "开",
			"zc": "正冲正冲乙卯",
			"ts": "厨灶门外东南"
		},
		"1126": {
			"y": "嫁娶.冠笄.安床.纳采.会亲友.塞穴.捕捉.置产.造畜椆栖.",
			"j": "开光.掘井.安葬.谢土.修坟.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "闭",
			"zc": "正冲正冲丙辰",
			"ts": "仓库栖外东南"
		},
		"1127": {
			"y": "祭祀.沐浴.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "建",
			"zc": "正冲正冲丁巳",
			"ts": "占房床外东南"
		},
		"1128": {
			"y": "祭祀.会亲友.嫁娶.沐浴.修造.动土.祈福.开光.塑绘.出行.订盟.纳采.裁衣.入殓.除服.成服.移柩.启攒.赴任.竖柱.上梁.纳财.扫舍.栽种.纳畜.伐木.",
			"j": "入宅.作灶.安床.开仓.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "除",
			"zc": "正冲正冲戊午",
			"ts": "占门碓外东南"
		},
		"1130": {
			"y": "祭祀.祈福.订盟.纳采.裁衣.拆卸.修造.动土.起基.安床.移徙.入宅.安香.除服.成服.入殓.移柩.安葬.谢土.赴任.会亲友.进人口.出行.竖柱.上梁.经络.开市.交易.立券.纳财.开仓.",
			"j": "作灶.治病.伐木.作梁.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "平",
			"zc": "正冲正冲庚申",
			"ts": "厨灶炉外正南"
		},
		"1226": {
			"y": "塑绘.开光.订盟.纳采.裁衣.冠笄.拆卸.修造.安床.入宅.出火.安葬.谢土.赴任.",
			"j": "掘井.伐木.斋醮.作灶.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲丙戌",
			"ts": "仓库栖外正北"
		},
		"1206": {
			"y": "沐浴.扫舍.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "收",
			"zc": "正冲正冲丙寅",
			"ts": "仓库炉外西南"
		},
		"1216": {
			"y": "祭祀.沐浴.破屋.坏垣.余事勿取.",
			"j": "嫁娶.移徙.入宅.探病.出行.造屋.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲丙子",
			"ts": "仓库碓外西北"
		},
		"1227": {
			"y": "祭祀.塑绘.开光.裁衣.冠笄.嫁娶.纳采.拆卸.修造.动土.竖柱.上梁.安床.移徙.入宅.安香.结网.捕捉.畋猎.伐木.进人口.放水.",
			"j": "出行.安葬.修坟.开市.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲丁亥",
			"ts": "占房床房内北"
		},
		"1207": {
			"y": "祭祀.沐浴.理发.纳财.进人口.栽种.扫舍.捕捉.畋猎.结网.",
			"j": "会亲友.安葬.入宅.移徙.安床.开市.行丧.出火.作灶.安门.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲丁卯",
			"ts": "房床门外西南"
		},
		"1222": {
			"y": "合帐.裁衣.教牛马.余事勿取.",
			"j": "入宅.动土.破土.嫁娶.作灶.造船.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲壬午",
			"ts": "房床碓外正北"
		},
		"1217": {
			"y": "冠笄.纳财.掘井.开池.出火.安床.交易.立券.畋猎.结网.理发.放水.",
			"j": "安门.动土.破土.行丧.安葬.成服.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "危",
			"zc": "正冲正冲丁丑",
			"ts": "房床厕外西北"
		},
		"1209": {
			"y": "入宅.移徙.出行.进人口.修造.动土.起基.上梁.安门.造仓.补垣.塞穴.造畜椆栖.",
			"j": "嫁娶.开市.安床.栽种.安葬.祈福.开光.掘井.安葬.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲己巳",
			"ts": "碓磨床外西南"
		},
		"1220": {
			"y": "祈福.斋醮.纳采.订盟.解除.架马.开柱眼.修造.动土.起基.上梁.归岫.造屋.合脊.掘井.除服.成服.破土.栽种.",
			"j": "移徙.开市.入宅.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "开",
			"zc": "正冲正冲庚辰",
			"ts": "厨灶栖外西北"
		},
		"1228": {
			"y": "祭祀.求医.破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "破",
			"zc": "正冲正冲戊子",
			"ts": "占门碓房内北"
		},
		"1201": {
			"y": "祭祀.祈福.订盟.纳采.裁衣.拆卸.修造.动土.起基.安床.移徙.入宅.安香.入殓.移柩.安葬.谢土.赴任.进人口.会亲友.",
			"j": "作灶.治病.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "定",
			"zc": "正冲正冲辛酉",
			"ts": "仓库门外正南"
		},
		"1202": {
			"y": "祭祀.塑绘.开光.订盟.纳采.嫁娶.安床.进人口.入殓.除服.成服.移柩.启攒.安葬.立碑.",
			"j": "开市.交易.破土.作灶.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "执",
			"zc": "正冲正冲壬戌",
			"ts": "房床栖外正南"
		},
		"1203": {
			"y": "祭祀.解除.破屋.坏垣.余事勿取.",
			"j": "诸事不宜.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "破",
			"zc": "正冲正冲癸亥",
			"ts": "占门床外正南"
		},
		"1204": {
			"y": "祭祀.解除.祈福.开光.塑绘.斋醮.订盟.纳采.裁衣.冠笄.拆卸.修造.动土.入殓.除服.成服.移柩.启攒.安床.赴任.出行.移徙.竖柱.上梁.伐木.栽种.破土.安葬.纳畜.",
			"j": "造屋.治病.",
			"c": "生肖冲鼠",
			"s": "煞北",
			"ch": "危",
			"zc": "正冲正冲甲子",
			"ts": "占碓磨外正南"
		},
		"1205": {
			"y": "祭祀.祈福.订盟.纳采.裁衣.合帐.冠笄.安机械.安床.造畜椆栖.入殓.移柩.启攒.安葬.谢土.除服.成服.会亲友.竖柱.上梁.经络.开市.交易.立券.纳财.纳畜.筑堤.",
			"j": "嫁娶.入宅.治病.赴任.",
			"c": "生肖冲牛",
			"s": "煞西",
			"ch": "成",
			"zc": "正冲正冲乙丑",
			"ts": "厨灶厕外西南"
		},
		"1208": {
			"y": "纳采.订盟.祭祀.祈福.求嗣.塑绘.解除.拆卸.修造.动土.竖柱.上梁.安门.置产.开池.掘井.纳畜.安床.栽种.造畜椆栖.破土.移柩.立碑.",
			"j": "嫁娶.开市.出火.进人口.入殓.赴任.入宅.移徙.出行.安葬.",
			"c": "生肖冲龙",
			"s": "煞北",
			"ch": "开",
			"zc": "正冲正冲戊辰",
			"ts": "门鸡栖外西南"
		},
		"1210": {
			"y": "造畜椆栖.教牛马.",
			"j": "入宅.移徙.分居.作灶.出火.安香.动土.嫁娶.掘井.扫舍.造桥.",
			"c": "生肖冲马",
			"s": "煞南",
			"ch": "建",
			"zc": "正冲正冲庚午",
			"ts": "厨灶碓外西南"
		},
		"1211": {
			"y": "订盟.纳采.造车器.祭祀.祈福.出行.安香.修造.动土.上梁.开市.交易.立券.移徙.入宅.会亲友.安机械.栽种.纳畜.造屋.起基.安床.造畜椆栖.",
			"j": "破土.安葬.行丧.开生坟.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲辛未",
			"ts": "仓库厕外西南"
		},
		"1212": {
			"y": "订盟.纳采.会亲友.安机械.开光.修造.动土.竖柱.上梁.造屋.起基.造桥.栽种.纳畜.造畜椆栖.移柩.入殓.启攒.修坟.立碑.安葬.",
			"j": "祈福.出火.嫁娶.入宅.开市.动土.破土.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲壬申",
			"ts": "房床厕外正南"
		},
		"1213": {
			"y": "祭祀.平治道涂.修坟.除服.成服.余事勿取.",
			"j": "移徙.入宅.嫁娶.掘井.安葬.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲癸酉",
			"ts": "占门厕外正南"
		},
		"1214": {
			"y": "嫁娶.冠笄.祭祀.祈福.求嗣.雕刻.开光.安香.出行.入学.修造.动土.竖柱.上梁.造屋.起基.安门.出火.移徙.入宅.掘井.造畜椆栖.安葬.破土.除服.成服.",
			"j": "开市.纳采.订盟.作灶.造庙.造船.经络.",
			"c": "生肖冲狗",
			"s": "煞南",
			"ch": "定",
			"zc": "正冲正冲甲戌",
			"ts": "碓磨栖外正西"
		},
		"1215": {
			"y": "嫁娶.订盟.纳采.祭祀.祈福.求嗣.斋醮.安香.出火.修造.起基.造屋.合脊.安门.安碓硙.动土.上梁.移徙.入宅.",
			"j": "出行.掘井.破土.行丧.安葬.",
			"c": "生肖冲猪",
			"s": "煞東",
			"ch": "执",
			"zc": "正冲正冲乙亥",
			"ts": "厨灶床外正西"
		},
		"1218": {
			"y": "纳采.订盟.移徙.入宅.出行.安机械.会亲友.祭祀.祈福.斋醮.开光.安香.出火.解除.求医.针灸.治病.造屋.起基.修造.安门.造船.纳畜.牧养.移柩.入殓.启攒.谢土.修坟.立碑.",
			"j": "嫁娶.动土.安床.造桥.掘井.",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲戊寅",
			"ts": "占门炉外西北"
		},
		"1219": {
			"y": "祭祀.沐浴.作灶.纳财.捕捉.畋猎.安床.扫舍.",
			"j": "开市.斋醮.破土.安葬.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲己卯",
			"ts": "占门炉外西北"
		},
		"1221": {
			"y": "纳采.订盟.祭祀.沐浴.冠笄.合帐.裁衣.修造.动土.拆卸.移徙.入宅.安门.开仓.筑堤.作厕.栽种.纳畜.补垣.塞穴.",
			"j": "嫁娶.祈福.开光.掘井.安葬.行丧.",
			"c": "生肖冲蛇",
			"s": "煞西",
			"ch": "闭",
			"zc": "正冲正冲辛巳",
			"ts": "仓库床外西北"
		},
		"1223": {
			"y": "纳采.订盟.嫁娶.祭祀.祈福.安香.出火.出行.会亲友.经络.求医.治病.解除.拆卸.起基.修造.动土.定磉.扫舍.栽种.牧养.造畜椆栖.",
			"j": "斋醮.作梁.掘井.行丧.安葬.",
			"c": "生肖冲羊",
			"s": "煞東",
			"ch": "除",
			"zc": "正冲正冲癸未",
			"ts": "占门厕外正北"
		},
		"1224": {
			"y": "纳财.开市.交易.立券.会亲友.进人口.经络.祭祀.祈福.安香.出火.求医.治病.修造.动土.拆卸.扫舍.安床.栽种.牧养.开生坟.合寿木.入殓.安葬.启攒.",
			"j": "嫁娶.祈福.出火.移徙.入宅.",
			"c": "生肖冲猴",
			"s": "煞北",
			"ch": "满",
			"zc": "正冲正冲甲申",
			"ts": "碓磨炉外正北"
		},
		"1225": {
			"y": "祭祀.入殓.移柩.余事勿取.",
			"j": "入宅.修造.动土.破土.安门.上梁.",
			"c": "生肖冲鸡",
			"s": "煞西",
			"ch": "平",
			"zc": "正冲正冲乙酉",
			"ts": "厨灶门外正北"
		},
		"1230": {
			"y": "塑绘.斋醮.出行.拆卸.解除.修造.移徙.造船.入殓.除服.成服.移柩.启攒.修坟.立碑.谢土.",
			"j": "",
			"c": "生肖冲虎",
			"s": "煞南",
			"ch": "成",
			"zc": "正冲正冲庚寅",
			"ts": "厨灶炉房内北"
		},
		"1231": {
			"y": "祭祀.沐浴.安床.纳财.畋猎.捕捉.",
			"j": "开市.破土.",
			"c": "生肖冲兔",
			"s": "煞東",
			"ch": "收",
			"zc": "正冲正冲辛卯",
			"ts": "仓库门房内北"
		}
	};
	return HuangLi_y2018[date]
}
module.exports = get_hl;